// Функция для отправки данных в базу данных Firebase
function writeToFirebase(data) {
  const databaseURL =
    "https://diplom-93856-default-rtdb.firebaseio.com/quizes.json"; // замените на URL вашей базы данных
  fetch(databaseURL, {
    method: "PUT",
    body: JSON.stringify(data),
    headers: {
      "Content-Type": "application/json",
    },
  })
    .then((response) => {
      if (!response.ok) {
        throw new Error("Network response was not ok");
      }
      console.log("Data has been sent to Firebase successfully");
    })
    .catch((error) => {
      console.error("There was a problem with the fetch operation:", error);
    });
}

// Данные для записи в базу данных
const quizzesData = {
  quiz1: {
    questions: [
      {
        id: 1,
        question: "Какая планета Солнечной системы известна своими кольцами?",
        options: ["Венера", "Марс", "Юпитер", "Сатурн"],
        correctAnswer: "Сатурн"
      },
      {
        id: 2,
        question: "Какая планета известна как 'Утренняя звезда' и 'Вечерняя звезда'?",
        options: ["Юпитер", "Сатурн", "Венера", "Марс"],
        correctAnswer: "Венера"
      },
      {
        id: 3,
        question: "Какая планета обладает самой быстрой орбитой вокруг Солнца?",
        options: ["Меркурий", "Уран", "Сатурн", "Юпитер"],
        correctAnswer: "Меркурий"
      },
      {
        id: 4,
        question: "Какая планета обладает самой долгой орбитой вокруг Солнца?",
        options: ["Юпитер", "Плутон", "Венера", "Нептун"],
        correctAnswer: "Плутон"
      },
      {
        id: 5,
        question: "Какой космический объект считается 'Красной планетой'?",
        options: ["Луна", "Марс", "Юпитер", "Меркурий"],
        correctAnswer: "Марс"
      },
      {
        id: 6,
        question: "Какая планета Солнечной системы обладает самыми высокими ветрами?",
        options: ["Солнце", "Уран", "Юпитер", "Нептун"],
        correctAnswer: "Нептун"
      },
      {
        id: 7,
        question: "Какой из спутников Юпитера обладает самой большой вулканической активностью?",
        options: ["Ио", "Европа", "Ганимед", "Каллисто"],
        correctAnswer: "Ио"
      },
      {
        id: 8,
        question: "Какая планета обладает наибольшим количеством спутников в Солнечной системе?",
        options: ["Нептун", "Марс", "Юпитер", "Сатурн"],
        correctAnswer: "Юпитер"
      },
      {
        id: 9,
        question: "Какая планета имеет самый длительный день?",
        options: ["Венера", "Земля", "Нептун", "Уран"],
        correctAnswer: "Венера"
      },
      {
        id: 10,
        question: "Какой космический объект считается 'Утраченной планетой'?",
        options: ["Ио", "АO-210", "Плутон", "Гали"],
        correctAnswer: "Плутон"
      }
    ]
  },
  quiz2: {
    questions: [
      {
        id: 1,
        question: "Какая планета обладает самой высокой горой в Солнечной системе?",
        options: ["Марс", "Земля", "Юпитер", "Венера"],
        correctAnswer: "Марс"
      },
      {
        id: 2,
        question: "Как называется самый большой спутник Сатурна?",
        options: ["Титан", "Рея", "Диона", "Япет"],
        correctAnswer: "Титан"
      },
      {
        id: 3,
        question: "Какая планета имеет самую большую магнитосферу?",
        options: ["Земля", "Юпитер", "Сатурн", "Нептун"],
        correctAnswer: "Юпитер"
      },
      {
        id: 4,
        question: "Какая планета Солнечной системы самая маленькая?",
        options: ["Плутон", "Марс", "Меркурий", "Венера"],
        correctAnswer: "Меркурий"
      },
      {
        id: 5,
        question: "На какой планете день длится дольше, чем год?",
        options: ["Венера", "Меркурий", "Марс", "Нептун"],
        correctAnswer: "Венера"
      },
      {
        id: 6,
        question: "Какая планета известна своим большим красным пятном?",
        options: ["Юпитер", "Марс", "Сатурн", "Нептун"],
        correctAnswer: "Юпитер"
      },
      {
        id: 7,
        question: "На какой планете находится самый большой вулкан в Солнечной системе?",
        options: ["Марс", "Земля", "Венера", "Меркурий"],
        correctAnswer: "Марс"
      },
      {
        id: 8,
        question: "Какой из спутников Сатурна имеет атмосферу?",
        options: ["Титан", "Рея", "Диона", "Энцелад"],
        correctAnswer: "Титан"
      },
      {
        id: 9,
        question: "Какая планета вращается в направлении, противоположном Земле?",
        options: ["Венера", "Юпитер", "Уран", "Марс"],
        correctAnswer: "Венера"
      },
      {
        id: 10,
        question: "Какой космический объект считается самой горячей планетой в Солнечной системе?",
        options: ["Венера", "Меркурий", "Марс", "Юпитер"],
        correctAnswer: "Венера"
      }
    ]
  },
  quiz3: {
    questions: [
      {
        id: 1,
        question: "Какая планета имеет самую плотную атмосферу?",
        options: ["Земля", "Марс", "Венера", "Юпитер"],
        correctAnswer: "Венера"
      },
      {
        id: 2,
        question: "Как называется самый крупный кратер на Луне?",
        options: ["Коперник", "Тихо", "Эйткен", "Архимед"],
        correctAnswer: "Эйткен"
      },
      {
        id: 3,
        question: "Какая планета известна своими сезонными штормами?",
        options: ["Марс", "Юпитер", "Нептун", "Сатурн"],
        correctAnswer: "Нептун"
      },
      {
        id: 4,
        question: "Какая планета самая холодная в Солнечной системе?",
        options: ["Нептун", "Уран", "Плутон", "Марс"],
        correctAnswer: "Уран"
      },
      {
        id: 5,
        question: "Какой спутник имеет подземный океан?",
        options: ["Европа", "Ганимед", "Титан", "Каллисто"],
        correctAnswer: "Европа"
      },
      {
        id: 6,
        question: "Какая планета известна своими полярными сияниями?",
        options: ["Юпитер", "Сатурн", "Земля", "Нептун"],
        correctAnswer: "Юпитер"
      },
      {
        id: 7,
        question: "Как называется самый большой вулкан на Марсе?",
        options: ["Олимп", "Павонис", "Арсия", "Аскрий"],
        correctAnswer: "Олимп"
      },
      {
        id: 8,
        question: "Какая планета известна как 'Синий гигант'?",
        options: ["Нептун", "Уран", "Сатурн", "Юпитер"],
        correctAnswer: "Нептун"
      },
      {
        id: 9,
        question: "Какой из спутников Сатурна обладает самой активной геологией?",
        options: ["Энцелад", "Титан", "Рея", "Мимас"],
        correctAnswer: "Энцелад"
      },
      {
        id: 10,
        question: "Какая планета была понижена в статусе до карликовой планеты в 2006 году?",
        options: ["Плутон", "Эрида", "Церера", "Макемаке"],
        correctAnswer: "Плутон"
      }
    ]
  },
  quiz4: {
    questions: [
      {
        id: 1,
        question: "Какая планета имеет самую тонкую атмосферу?",
        options: ["Меркурий", "Марс", "Плутон", "Луна"],
        correctAnswer: "Меркурий"
      },
      {
        id: 2,
        question: "Какой космический объект обладает самым сильным гравитационным полем?",
        options: ["Юпитер", "Солнце", "Нептун", "Сатурн"],
        correctAnswer: "Солнце"
      },
      {
        id: 3,
        question: "Какая планета известна своим огромным каньоном, который называется Долина Маринера?",
        options: ["Марс", "Земля", "Венера", "Юпитер"],
        correctAnswer: "Марс"
      },
      {
        id: 4,
        question: "Какой из спутников Юпитера покрыт льдом?",
        options: ["Европа", "Ио", "Каллисто", "Ганимед"],
        correctAnswer: "Европа"
      },
      {
        id: 5,
        question: "Какая планета Солнечной системы обладает самым большим количеством колец?",
        options: ["Сатурн", "Юпитер", "Нептун", "Уран"],
        correctAnswer: "Сатурн"
      },
      {
        id: 6,
        question: "Какая планета находится на самом большом расстоянии от Солнца?",
        options: ["Нептун", "Уран", "Плутон", "Марс"],
        correctAnswer: "Нептун"
      },
      {
        id: 7,
        question: "Какой из спутников Юпитера был открыт Галилео Галилеем?",
        options: ["Ио", "Каллисто", "Европа", "Ганимед"],
        correctAnswer: "Все перечисленные"
      },
      {
        id: 8,
        question: "Какая планета известна как 'Сестра Земли'?",
        options: ["Венера", "Марс", "Юпитер", "Меркурий"],
        correctAnswer: "Венера"
      },
      {
        id: 9,
        question: "Какой космический объект обладает самым большим количеством лун?",
        options: ["Юпитер", "Сатурн", "Уран", "Нептун"],
        correctAnswer: "Сатурн"
      },
      {
        id: 10,
        question: "Какая планета известна своим большим северным полюсом?",
        options: ["Уран", "Нептун", "Юпитер", "Сатурн"],
        correctAnswer: "Уран"
      }
    ]
  }
};


// Вызов функции для записи данных в базу данных
writeToFirebase(quizzesData);
